# 國立虎尾科大機械設計工程系大二電腦輔助設計實習課程規劃
# 二十一世紀的機械設計產品開發, 必須能夠直接在網路上進行協同設計, 系統與產品都必須納入產品生命週期管理外, 所有工具都應該能夠隨著需求變更而持續改進.
# syllabus.py
# 各學員利用學校所發的 Gmail 帳號, 以學號作為帳號申請 github 帳號
# 期中考週前, 主要實習項目為 task1.py, 目標為組裝一台 Kossel Delta 3D printer, 並利用 Solvespace, OnShape, Creo Parametric, Solidworks 建立零組件ㄡ
# 期中考週之後, 則以開發一套能讓所有課程組員進行網際協同設計的系統, 以能夠完成本課程之協同課程評量任務為例, 設為本課程之 task2.py.
# 各組可自選組員每組 4-7 人, 所有學員在電腦輔助設計室中的座位採電腦程式編排座位, 且該程式的開發設為計算機程式課程範例 task1.py
'''
電腦輔助設計實習課程宣言:
你們完全不用擔心課程成績，能讓你不及格的，只有你們自己。
來不來上課，
想不想浪費父母的錢，
想不想學東西，
想不想以後有個好學歷、好工作、好家庭，
完全操之在你們自己，
'''
# 上課方式: 課堂講解, 課堂提問與討論, 各成員 github 與 bitbucket (僅作為同步備份用) 倉儲的協同與維護 (採基本的提交推送與拉回請求等模式)
# 課程評量: 學員自評 (30%), 組內學員互評 (30%), 各組員 github 倉儲與靜態網誌內容評量 (40%) (此一網際課程評量程式設為本課程 task2.py)
